{"backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 32}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "units": 128, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "units": 10, "activation": "softmax", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}]}